
public class kopo44_04 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		String[] OneRec = {
				"순번,상호명,소재지(도로명),연락처",
				"1,샤랄랄라,부산광역시 북구 금곡대로 469 농협하나로클럽 2층 (금곡동),070-7450-8460",
				"2,꼬마다락방,부산광역시 북구 구포시장길 48 3층 (구포동),051-338-5559",
				"3,아이점프 부산북구점,부산광역시 북구 낙동북로 736 유림노르웨이숲상가 401호 (구포동),070-8805-1188",
				"4,파리봉봉(화명점),부산광역시 북구 금곡대로303번길 2 시티타워 1201호 (화명동),051-363-0060",
				"5,더놀다 부산화명점,부산광역시 북구 화명대로 32 다운타운프라자 5층 502호 (화명동),051-363-3631",
				"6,아이점프 만덕점,부산광역시 북구 만덕3로16번길 11 4층(만덕동벽산라인훼미리타운),070-8252-3921",
				"7,키즈파크,부산광역시 북구 만덕대로 23 폴라렉스 5층 (덕천동),000-000-0000",
				"8,디지털팡팡 화명점,부산광역시 북구 금곡대로 230 금용복합스포츠타운 6층 (화명동),051-365-7272",
				"9,주니어킹덤,부산광역시 북구 화명대로 17 목양프라자 4층,051-363-2288"	
		};
		String[] field_name = OneRec[0].split(",");
		for (int i = 1; i < OneRec.length - 1; i++) {
			String[] field = OneRec[i].split(",");
			System.out.printf("**********************************************************************************\n");
			for (int j = 0; j < field_name.length; j++) {
				
				System.out.printf(" %s : %s\n", field_name[j], field[j]);
			}
			System.out.printf("**********************************************************************************\n");
		}
	}

}
