
public class kopo44_03 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		String[] OneRec = {//16개칸
				 " 참-0d974rion-초a0 5,000,000 2 10,000,000",
				 " a갈아4만든배로만     14,020 4     56,080",
				 " 질레트-퓨전프로글    25,000 1     25,000",
				 " 해태-허니버터칩          10 2         20",
				 "*대구에서온맛난사      1,206 5      6,030",
				 "*천혜향제주감귤        1,350 4      5,400",
				 "*강원도고랭지햇감      7,01910     70,190",
				 "*고시히카리쌀20Kg     35,000 1     35,000",
				 " 비말마스1크블랙특     9,90010     99,000",
				 " 아디다스-슈퍼스타    89,000 1     89,000",
				 " 아디다스-야구글러   123,500 1    123,500",
				 "*직d접담근배추김치 9,999,999 2 19,999,998",
				 "*제주원산지은갈치     12,000 4     48,000",
				 " 돌체구스토-커피머   143,200 1    143,200",
				 " 깨끗한나라-물티슈     8,900 4     35,600",
				 "*맛있는꿀맛애호박      1,080 5      5,400",
				 " 공화춘-컵라면           790 3      2,370",
				 " 농심신라면블랙          670 3      2,010",
				 " 이마트/연어초밥       9,900 1      9,900",
				 " 피코크-들깨미역국   412,900 2    825,800",
				 " 녹차원흑당시럽1입     7,741 1      7,741",
				 " 상투과좌특별중기      1,230 2      2,460",
				 " 동원-양반볶음김치       300 3        900",
				 "*유기농국산바나나      1,900 5      9,500",
				 "*김                    7,800 1      7,800",
				 " 디지털복합체중계     23,000 1     23,000",
				 " 황도백도믹스통조          1 6          6",
				 " 오리온-포카칩오리     1,200 2      2,400",
				 " 프링글스-핫스파이        12 1         12",
				 " 맥심-모카골드대용     6,400 1      6,400"
		};
		
		String[] name = new String[OneRec.length];
		int[] price = new int[OneRec.length];
		int[] quantity = new int[OneRec.length];
		int[] sum = new int[OneRec.length];
		int[] comsum = new int[OneRec.length];
		
		for (int i = 0; i < OneRec.length; i++) {
			byte[] bb = OneRec[i].getBytes();
			name[i] = new String(bb,0, 19);
			price[i] = Integer.parseInt(new String(bb,19, 9).trim().replace(",", ""));
			quantity[i] =
			
			
		
		
		}
		

	}

}
